# -*- coding: utf-8 -*-

TYPE_CHOICES = (
    (1, 'Число'),
    (2, 'Строка'),
    (3, 'Список'),
    (4, 'Формула')
)

FORMULA_CHOICES = (
    (0, 'Пусто'),
    (1, 'Сумма')
)

COLOR_CHOICES = (
    (0, 'default'),
    (1, 'primary'),
    (2, 'success'),
    (3, 'warning'),
    (4, 'danger'),
    (5, 'info')
)

EVENT_CHOICES = (
    (0, 'Создание отчета'),
    (1, 'Редактирование отчета'),
    (2, 'Открытие отчета'),
    (3, 'Добавление значений'),
    (4, 'Просмотр истории'),
    (5, 'Добавление строки'),
    (6, 'Удаление строки'),
)
